trade_exp/src/Enums/ТипыКассККМ/ТипыКассККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКассККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АвтономнаяККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ЧекККМВозврат/ЧекККМВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЧекККМВозврат</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизацииСпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаБонусныхБалловКВозврату</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6efd4c0-aadb-4fbc-bab2-5bb6f02a424f">
    <name>СторноОрдер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="017fb748-2a94-46b5-a01d-8eaba05eaa20">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60dd2802-f9c1-435e-923c-d459e0c47112">
    <name>ДатаПоследнегоОткрытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8c72a24-a385-45d4-9b74-f0036e4d090c">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2838228-73ec-4d7e-9180-86f69e84dd8e">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d5501ee7-ab3c-46cd-b2a5-2895d1a748a2">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37bb3306-a9d4-4d76-ab58-8b95bdb8edf4">
    <name>ПодразделениеМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55fa59b5-6609-46c8-8c2e-e86b95d64bed">
    <name>ОтделМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураЕГАИС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Продавец</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="285439ea-2699-4a2a-b693-b5ca7dcf27c1">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОплатаОтменена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>6</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СсылочныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>22</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерЧекаЭТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БонусныеБаллы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДатаНачисления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаСписания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>БонуснаяПрограммаЛояльности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/CommonModules/РозничныеПродажи/Module.bsl
&ИзменениеИКонтроль ("ЗаполнитьОтчетОРозничныхПродажах")   
Функция Док_ЗаполнитьОтчетОРозничныхПродажах(ОтчетОРозничныхПродажахОбъект, СостояниеКассовойСмены, НалогообложениеНДС, МенеджерВременныхТаблиц, ТолькоЗаполнить = Ложь, ОписаниеОшибки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Заполнение отчета о розничных продажах
	Попытка
		
		ЭтоПопыткаПроведенияДокумента = Ложь;
		
		// Подготовка данных.
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЧекККМТовары.ПоЧекуКоррекции КАК ПоЧекуКоррекции,
		|	ЧекККМТовары.Ссылка КАК Ссылка,
		|	ЧекККМТовары.ЧекККМ КАК ЧекККМ,
		|	ЧекККМТовары.Дата КАК Дата,
		|	ЧекККМТовары.НоменклатураНабора КАК НоменклатураНабора,
		|	ЧекККМТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ЧекККМТовары.Номенклатура КАК Номенклатура,
		|	ЧекККМТовары.Характеристика КАК Характеристика,
		|	ЧекККМТовары.Серия КАК Серия,
		|	ЧекККМТовары.Упаковка КАК Упаковка,
		|	ЧекККМТовары.Цена КАК Цена,
		|	ЧекККМТовары.СтавкаНДС КАК СтавкаНДС,
		|	ЧекККМТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЧекККМТовары.Количество КАК Количество,
		|	ЧекККМТовары.Сумма КАК Сумма,
		|	ЧекККМТовары.СуммаНДС КАК СуммаНДС,
		|	ЧекККМТовары.Склад КАК Склад,
		|	ЧекККМТовары.Партнер КАК Партнер,
		|	ЧекККМТовары.Помещение КАК Помещение,
		|	ЧекККМТовары.Продавец КАК Продавец,
		|	ЧекККМТовары.Валюта КАК Валюта,
		|	ЧекККМТовары.ВидЦены КАК ВидЦены,
		|	ЧекККМТовары.КассаККМ КАК КассаККМ,
		|	ЧекККМТовары.Организация КАК Организация,
		|	ЧекККМТовары.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ЧекККМТовары.ЧекККМНалогообложениеНДС КАК ЧекККМНалогообложениеНДС,
		|	ЧекККМТовары.ЧекККМКассоваяСмена КАК ЧекККМКассоваяСмена,
		|	ЧекККМТовары.ЧекККМПоКоторомуОформленПроблемныйВозврат КАК ЧекККМПоКоторомуОформленПроблемныйВозврат
		|ПОМЕСТИТЬ СписокТоваров
		|ИЗ
		|	ТоварыРозничныхПродаж КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.НалогообложениеНДС = &НалогообложениеНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокТоваров.ПоЧекуКоррекции КАК ПоЧекуКоррекции,
		|	СписокТоваров.Ссылка КАК Ссылка,
		|	СписокТоваров.ЧекККМНалогообложениеНДС КАК ЧекККМНалогообложениеНДС,
		|	СписокТоваров.ЧекККМКассоваяСмена КАК ЧекККМКассоваяСмена,
		|	СписокТоваров.КассаККМ КАК КассаККМ,
		|	СписокТоваров.Организация КАК Организация,
		|	СписокТоваров.Склад КАК Склад,
		|	СписокТоваров.Валюта КАК Валюта,
		|	СписокТоваров.ВидЦены КАК ВидЦены,
		|	СписокТоваров.НалогообложениеНДС КАК НалогообложениеНДС,
		|	СписокТоваров.Партнер КАК Партнер,
		|	СписокТоваров.Дата КАК Дата,
		|	СписокТоваров.ЧекККМ КАК ЧекККМ,
		|	ВЫБОР КОГДА ЧекиККМПоКоторымОформленВозвратВСмену.ЧекККМ ЕСТЬ NULL
		|		ТОГДА ЛОЖЬ 
		|		ИНАЧЕ ИСТИНА 
		|	КОНЕЦ КАК ВозвратВСменуПродажи
		|ПОМЕСТИТЬ ЧекиККМ
		|ИЗ
		|	СписокТоваров КАК СписокТоваров
        |	ЛЕВОЕ СОЕДИНЕНИЕ ЧекиККМПоКоторымОформленВозвратВСмену КАК ЧекиККМПоКоторымОформленВозвратВСмену
		|	ПО ЧекиККМПоКоторымОформленВозвратВСмену.ЧекККМ = СписокТоваров.ЧекККМ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЧекиККМДокументыРеализации.КассоваяСмена КАК КассоваяСмена,
		|	ЧекиККМДокументыРеализации.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ЧекиККМДокументыРеализации.ДокументРеализации КАК ДокументРеализации
		|ИЗ
		|	ЧекиККМДокументыРеализации КАК ЧекиККМДокументыРеализации
		|ГДЕ
		|	НЕ ЧекиККМДокументыРеализации.ДокументРеализации = НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокТоваров.Валюта КАК Валюта,
		|	СписокТоваров.ВидЦены КАК ВидЦены,
		|	СписокТоваров.КассаККМ КАК КассаККМ,
		|	СписокТоваров.Организация КАК Организация,
		#Удаление
		|	СписокТоваров.НалогообложениеНДС КАК НалогообложениеНДС,
		|	СписокТоваров.Склад КАК Склад
		#КонецУдаления
		#Вставка
		|	СписокТоваров.НалогообложениеНДС КАК НалогообложениеНДС
		#КонецВставки
		|ИЗ
		|	ЧекиККМ КАК СписокТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокТоваров.НоменклатураНабора КАК НоменклатураНабора,
		|	СписокТоваров.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	СписокТоваров.Номенклатура КАК Номенклатура,
		|	СписокТоваров.Характеристика КАК Характеристика,
		|	СписокТоваров.Серия КАК Серия,
		|	СписокТоваров.Упаковка КАК Упаковка,
		|	СписокТоваров.Цена КАК Цена,
		#Удаление
		|	СписокТоваров.СтавкаНДС КАК СтавкаНДС
		#КонецУдаления
		#Вставка
		|	СписокТоваров.СтавкаНДС КАК СтавкаНДС,
		|	СписокТоваров.Склад КАК Склад
		#КонецВставки
		|ИЗ
		|	СписокТоваров КАК СписокТоваров";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("КассоваяСмена", СостояниеКассовойСмены.КассоваяСмена);
		Запрос.УстановитьПараметр("НалогообложениеНДС", НалогообложениеНДС);
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		ТаблицаДокументовРеализации = МассивРезультатов[2].Выгрузить();
		ТаблицаДокументовРеализации.Индексы.Добавить("КассоваяСмена,НалогообложениеНДС");
		
		// Формирование таблиц индексов по аналитике и номенклатуре
		ТаблицаИндексовПоАналитике = МассивРезультатов[3].Выгрузить();
		#Вставка
		// Сворачиваю таблицу т.к. теперь в чеках могут быть разные виды цен
		Если ТаблицаИндексовПоАналитике.Количество() > 1 Тогда
			ВидЦены= ТаблицаИндексовПоАналитике[0].ВидЦены;
			ТаблицаИндексовПоАналитике.ЗаполнитьЗначения(ВидЦены, "ВидЦены");
			ТаблицаИндексовПоАналитике.Свернуть("Валюта,КассаККМ,Организация,НалогообложениеНДС,ВидЦены");
		КонецЕсли;
	    #КонецВставки
		ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ТаблицаИндексовПоАналитике,"Индекс");
		
		ТаблицаИндексовПоНоменклатуре = МассивРезультатов[4].Выгрузить();
		ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ТаблицаИндексовПоНоменклатуре,"Индекс");

		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаИндексов.Индекс КАК ИндексПоАналитике,
		|	ТаблицаИндексов.Валюта КАК Валюта,
		|	ТаблицаИндексов.ВидЦены КАК ВидЦены,
		|	ТаблицаИндексов.КассаККМ КАК КассаККМ,
		|	ТаблицаИндексов.Организация КАК Организация,
		#Удаление
		|	ТаблицаИндексов.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ТаблицаИндексов.Склад КАК Склад
		#КонецУдаления
		#Вставка
		|	ТаблицаИндексов.НалогообложениеНДС КАК НалогообложениеНДС
		#КонецВставки
		|ПОМЕСТИТЬ ИндексыПоАналитике
		|ИЗ
		|	&ТаблицаИндексовПоАналитике КАК ТаблицаИндексов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Валюта,
		|	ВидЦены,
		|	КассаККМ,
		|	Организация,
		#Удаление
		|	НалогообложениеНДС,
		|	Склад
		#КонецУдаления
		#Вставка
		|	НалогообложениеНДС
		#КонецВставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИндексов.Индекс КАК ИндексПоНоменклатуре,
		|	ТаблицаИндексов.НоменклатураНабора КАК НоменклатураНабора,
		|	ТаблицаИндексов.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ТаблицаИндексов.Номенклатура КАК Номенклатура,
		|	ТаблицаИндексов.Характеристика КАК Характеристика,
		|	ТаблицаИндексов.Серия КАК Серия,
		|	ТаблицаИндексов.Упаковка КАК Упаковка,
		|	ТаблицаИндексов.Цена КАК Цена,
		#Удаление
		|	ТаблицаИндексов.СтавкаНДС КАК СтавкаНДС
		#КонецУдаления
		#Вставка
		|	ТаблицаИндексов.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаИндексов.Склад КАК Склад
		#КонецВставки
		|ПОМЕСТИТЬ ИндексыПоНоменклатуре
		|ИЗ
		|	&ТаблицаИндексовПоНоменклатуре КАК ТаблицаИндексов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НоменклатураНабора,
		|	ХарактеристикаНабора,
		|	Номенклатура,
		|	Характеристика,
		|	Серия,
		|	Упаковка,
		|	Цена,
		|	СтавкаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокТоваров.ПоЧекуКоррекции КАК ПоЧекуКоррекции,
		|	СписокТоваров.НоменклатураНабора КАК НоменклатураНабора,
		|	СписокТоваров.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	СписокТоваров.Номенклатура КАК Номенклатура,
		|	СписокТоваров.Характеристика КАК Характеристика,
		|	СписокТоваров.Серия КАК Серия,
		|	СписокТоваров.Упаковка КАК Упаковка,
		|	СписокТоваров.Цена КАК Цена,
		|	СписокТоваров.Партнер КАК Партнер,
		|	СписокТоваров.Помещение КАК Помещение,
		|	СписокТоваров.Продавец КАК Продавец,
		|	СписокТоваров.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(СписокТоваров.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	СУММА(СписокТоваров.Количество) КАК Количество,
		|	СУММА(СписокТоваров.Сумма) КАК Сумма,
		|	СУММА(СписокТоваров.СуммаНДС) КАК СуммаНДС,
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике,
		|	ИндексыПоНоменклатуре.ИндексПоНоменклатуре КАК ИндексПоНоменклатуре,
		|	СписокТоваров.Склад КАК Склад,
		|	СписокТоваров.Валюта КАК Валюта,
		|	СписокТоваров.ВидЦены КАК ВидЦены,
		|	СписокТоваров.КассаККМ КАК КассаККМ,
		|	СписокТоваров.Организация КАК Организация,
		|	СписокТоваров.НалогообложениеНДС КАК НалогообложениеНДС,
		|	СписокТоваров.ЧекККМНалогообложениеНДС КАК ЧекККМНалогообложениеНДС,
		|	СписокТоваров.ЧекККМКассоваяСмена КАК ЧекККМКассоваяСмена
		|ИЗ
		|	(ВЫБРАТЬ
		|		СписокТоваров.ЧекККМ КАК ЧекККМ,
		|		СписокТоваров.ПоЧекуКоррекции КАК ПоЧекуКоррекции,
		|		СписокТоваров.НоменклатураНабора КАК НоменклатураНабора,
		|		СписокТоваров.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|		СписокТоваров.Номенклатура КАК Номенклатура,
		|		СписокТоваров.Характеристика КАК Характеристика,
		|		СписокТоваров.Серия КАК Серия,
		|		СписокТоваров.СтавкаНДС КАК СтавкаНДС,
		|		СписокТоваров.Упаковка КАК Упаковка,
		|		ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА СписокТоваров.КоличествоУпаковок = 0
		|					ТОГДА СписокТоваров.Сумма
		|				ИНАЧЕ СписокТоваров.Сумма / СписокТоваров.КоличествоУпаковок
		|			КОНЕЦ КАК ЧИСЛО(31, 2)) КАК Цена,
		|		СписокТоваров.Партнер КАК Партнер,
	    |		МАКСИМУМ(СписокТоваров.Помещение) КАК Помещение,
		|		СписокТоваров.Продавец КАК Продавец,
		|		СУММА(СписокТоваров.КоличествоУпаковок) КАК КоличествоУпаковок,
		|		СУММА(СписокТоваров.Количество) КАК Количество,
		|		СУММА(СписокТоваров.Сумма) КАК Сумма,
		|		СУММА(СписокТоваров.СуммаНДС) КАК СуммаНДС,
		|		СписокТоваров.Склад КАК Склад,
		|		СписокТоваров.Валюта КАК Валюта,
		|		СписокТоваров.ВидЦены КАК ВидЦены,
		|		СписокТоваров.КассаККМ КАК КассаККМ,
		|		СписокТоваров.Организация КАК Организация,
		|		СписокТоваров.НалогообложениеНДС КАК НалогообложениеНДС,
		|		СписокТоваров.ЧекККМНалогообложениеНДС КАК ЧекККМНалогообложениеНДС,
		|		СписокТоваров.ЧекККМКассоваяСмена КАК ЧекККМКассоваяСмена
		|	ИЗ
		|		СписокТоваров КАК СписокТоваров
		|	ГДЕ
		|		СписокТоваров.ЧекККМПоКоторомуОформленПроблемныйВозврат = ЛОЖЬ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СписокТоваров.ЧекККМ,
		|		СписокТоваров.ПоЧекуКоррекции,
		|		СписокТоваров.НоменклатураНабора,
		|		СписокТоваров.ХарактеристикаНабора,
		|		СписокТоваров.Номенклатура,
		|		СписокТоваров.Характеристика,
		|		СписокТоваров.Серия,
		|		СписокТоваров.СтавкаНДС,
		|		СписокТоваров.Упаковка,
		|		ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА СписокТоваров.КоличествоУпаковок = 0
		|					ТОГДА СписокТоваров.Сумма
		|				ИНАЧЕ СписокТоваров.Сумма / СписокТоваров.КоличествоУпаковок
		|			КОНЕЦ КАК ЧИСЛО(31, 2)),
		|		СписокТоваров.Партнер,
		|		СписокТоваров.Продавец,
		|		СписокТоваров.Склад,
		|		СписокТоваров.Валюта,
		|		СписокТоваров.ВидЦены,
		|		СписокТоваров.КассаККМ,
		|		СписокТоваров.Организация,
		|		СписокТоваров.НалогообложениеНДС,
		|		СписокТоваров.ЧекККМНалогообложениеНДС,
		|		СписокТоваров.ЧекККМКассоваяСмена
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		СписокТоваров.ЧекККМ КАК ЧекККМ,
		|		СписокТоваров.ПоЧекуКоррекции КАК ПоЧекуКоррекции,
		|		СписокТоваров.НоменклатураНабора КАК НоменклатураНабора,
		|		СписокТоваров.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|		СписокТоваров.Номенклатура КАК Номенклатура,
		|		СписокТоваров.Характеристика КАК Характеристика,
		|		СписокТоваров.Серия КАК Серия,
		|		СписокТоваров.СтавкаНДС КАК СтавкаНДС,
		|		СписокТоваров.Упаковка КАК Упаковка,
		|		ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА СписокТоваров.КоличествоУпаковок = 0
		|					ТОГДА СписокТоваров.Сумма
		|				ИНАЧЕ СписокТоваров.Сумма / СписокТоваров.КоличествоУпаковок
		|			КОНЕЦ КАК ЧИСЛО(31, 2)) КАК Цена,
		|		СписокТоваров.Партнер КАК Партнер,
		|		МАКСИМУМ(СписокТоваров.Помещение) КАК Помещение,
		|		МАКСИМУМ(СписокТоваров.Продавец) КАК Продавец,
		|		СУММА(СписокТоваров.КоличествоУпаковок) КАК КоличествоУпаковок,
		|		СУММА(СписокТоваров.Количество) КАК Количество,
		|		СУММА(СписокТоваров.Сумма) КАК Сумма,
		|		СУММА(СписокТоваров.СуммаНДС) КАК СуммаНДС,
		|		СписокТоваров.Склад КАК Склад,
		|		СписокТоваров.Валюта КАК Валюта,
		#Удаление
		|		СписокТоваров.ВидЦены КАК ВидЦены,
		#КонецУдаления
		#Вставка
		|		СписокТоваров.Склад.РозничныйВидЦены КАК ВидЦены,
		#КонецВставки
		|		СписокТоваров.КассаККМ КАК КассаККМ,
		|		СписокТоваров.Организация КАК Организация,
		|		СписокТоваров.НалогообложениеНДС КАК НалогообложениеНДС,
		|		СписокТоваров.ЧекККМНалогообложениеНДС КАК ЧекККМНалогообложениеНДС,
		|		СписокТоваров.ЧекККМКассоваяСмена КАК ЧекККМКассоваяСмена
		|	ИЗ
		|		СписокТоваров КАК СписокТоваров
        |	ГДЕ
		|		СписокТоваров.ЧекККМПоКоторомуОформленПроблемныйВозврат = ИСТИНА
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СписокТоваров.ЧекККМ,
		|		СписокТоваров.ПоЧекуКоррекции,
		|		СписокТоваров.НоменклатураНабора,
		|		СписокТоваров.ХарактеристикаНабора,
		|		СписокТоваров.Номенклатура,
		|		СписокТоваров.Характеристика,
		|		СписокТоваров.Серия,
		|		СписокТоваров.СтавкаНДС,
		|		СписокТоваров.Упаковка,
		|		ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА СписокТоваров.КоличествоУпаковок = 0
		|					ТОГДА СписокТоваров.Сумма
		|				ИНАЧЕ СписокТоваров.Сумма / СписокТоваров.КоличествоУпаковок
		|			КОНЕЦ КАК ЧИСЛО(31, 2)),
		|		СписокТоваров.Партнер,
		|		СписокТоваров.Склад,
		|		СписокТоваров.Валюта,
		#Удаление
		|		СписокТоваров.ВидЦены,
		#КонецУдаления
		#Вставка
		|		СписокТоваров.Склад.РозничныйВидЦены,
		#КонецВставки
		|		СписокТоваров.КассаККМ,
		|		СписокТоваров.Организация,
		|		СписокТоваров.НалогообложениеНДС,
		|		СписокТоваров.ЧекККМНалогообложениеНДС,
		|		СписокТоваров.ЧекККМКассоваяСмена
		|	) КАК СписокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		#Удаление
		|		ПО СписокТоваров.Склад = ИндексыПоАналитике.Склад
		|			И СписокТоваров.Валюта = ИндексыПоАналитике.Валюта
		#КонецУдаления
		#Вставка
		|		ПО СписокТоваров.Валюта = ИндексыПоАналитике.Валюта
		#КонецВставки
		|			И СписокТоваров.ВидЦены = ИндексыПоАналитике.ВидЦены
		|			И СписокТоваров.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И СписокТоваров.Организация = ИндексыПоАналитике.Организация
		|			И СписокТоваров.НалогообложениеНДС = ИндексыПоАналитике.НалогообложениеНДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоНоменклатуре КАК ИндексыПоНоменклатуре
		|		ПО СписокТоваров.Номенклатура = ИндексыПоНоменклатуре.Номенклатура
		|			И СписокТоваров.НоменклатураНабора = ИндексыПоНоменклатуре.НоменклатураНабора
		|			И СписокТоваров.ХарактеристикаНабора = ИндексыПоНоменклатуре.ХарактеристикаНабора
		|			И СписокТоваров.Характеристика = ИндексыПоНоменклатуре.Характеристика
		|			И СписокТоваров.Серия = ИндексыПоНоменклатуре.Серия
		|			И СписокТоваров.Упаковка = ИндексыПоНоменклатуре.Упаковка
		|			И СписокТоваров.Цена = ИндексыПоНоменклатуре.Цена
		|			И СписокТоваров.СтавкаНДС = ИндексыПоНоменклатуре.СтавкаНДС
		#Вставка
		|			И СписокТоваров.Склад = ИндексыПоНоменклатуре.Склад
		#КонецВставки
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокТоваров.ПоЧекуКоррекции,
		|	СписокТоваров.НоменклатураНабора,
		|	СписокТоваров.ХарактеристикаНабора,
		|	СписокТоваров.Номенклатура,
		|	СписокТоваров.Характеристика,
		|	СписокТоваров.Серия,
		|	СписокТоваров.СтавкаНДС,
		|	СписокТоваров.Упаковка,
		|	СписокТоваров.Цена,
		|	СписокТоваров.Партнер,
		|	СписокТоваров.Помещение,
		|	СписокТоваров.Продавец,
		|	ИндексыПоНоменклатуре.СтавкаНДС,
		|	ИндексыПоАналитике.ИндексПоАналитике,
		|	ИндексыПоНоменклатуре.ИндексПоНоменклатуре,
		|	СписокТоваров.Склад,
		|	СписокТоваров.Валюта,
		|	СписокТоваров.ВидЦены,
		|	СписокТоваров.КассаККМ,
		|	СписокТоваров.Организация,
		|	СписокТоваров.НалогообложениеНДС,
		|	СписокТоваров.ЧекККМНалогообложениеНДС,
		|	СписокТоваров.ЧекККМКассоваяСмена
		|
		|ИМЕЮЩИЕ
		|	СУММА(СписокТоваров.Количество) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Серия,
		|	Упаковка,
		|	ВидЦены,
		|	Цена,
		|	Партнер,
		|	Продавец,
		|	ИндексПоАналитике,
		|	ПоЧекуКоррекции
		|ИТОГИ
		|	МАКСИМУМ(НоменклатураНабора),
		|	МАКСИМУМ(ХарактеристикаНабора),
		|	МАКСИМУМ(Номенклатура),
		|	МАКСИМУМ(Характеристика),
		|	МАКСИМУМ(Серия),
		|	МАКСИМУМ(Упаковка),
		|	МАКСИМУМ(Цена),
		|	МАКСИМУМ(Партнер),
		|	МАКСИМУМ(Помещение),
		|	МАКСИМУМ(Продавец),
		|	МАКСИМУМ(СтавкаНДС),
		|	МАКСИМУМ(КоличествоУпаковок),
		|	МАКСИМУМ(Количество),
		|	МАКСИМУМ(Сумма),
		|	МАКСИМУМ(СуммаНДС),
		|	МАКСИМУМ(Склад),
		|	МАКСИМУМ(Валюта),
		|	МАКСИМУМ(ВидЦены),
		|	МАКСИМУМ(КассаККМ),
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(НалогообложениеНДС)
		|ПО
		|	ИндексПоАналитике,
		|	ИндексПоНоменклатуре
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОплатаПлатежнымиКартами.ВидОплаты КАК ВидОплаты,
		|	ОплатаПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
		|	ОплатаПлатежнымиКартами.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
		|	ОплатаПлатежнымиКартами.КодАвторизации КАК КодАвторизации,
		|	ОплатаПлатежнымиКартами.ДоговорПодключения КАК ДоговорПодключения,
		#Удаление			
		|	СУММА(ОплатаПлатежнымиКартами.Сумма) КАК Сумма,
		#КонецУдаления
		#Вставка
		|	ОплатаПлатежнымиКартами.Сумма КАК Сумма,
		#КонецВставки
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике
		|ИЗ
        // Все оплаты чеков продажи за смену, кроме полностью возвращенных и которые были оплачены смешанно
		|	(ВЫБРАТЬ
		|		1 КАК НомерГруппировки,
		|		ЧекККМОплатаПлатежнымиКартами.ВидОплаты КАК ВидОплаты,
		|		ЧекККМОплатаПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
		|		ВЫБОР КОГДА ЧекиККМПоКоторымОформленВозвратВСмену.ЧекККМ ЕСТЬ NULL
		|			ТОГДА ЧекККМОплатаПлатежнымиКартами.НомерПлатежнойКарты
		|			ИНАЧЕ """" КОНЕЦ КАК НомерПлатежнойКарты,
		|		ВЫБОР КОГДА ЧекиККМПоКоторымОформленВозвратВСмену.ЧекККМ ЕСТЬ NULL
		|			ТОГДА ЧекККМОплатаПлатежнымиКартами.КодАвторизации
		|			ИНАЧЕ """" КОНЕЦ КАК КодАвторизации,
		|		ЧекККМОплатаПлатежнымиКартами.ДоговорПодключения КАК ДоговорПодключения,
		|		ЧекККМОплатаПлатежнымиКартами.Сумма КАК Сумма,
		|		ЧекиККМ.КассаККМ КАК КассаККМ,
		|		ЧекиККМ.Организация КАК Организация,
		|		ЧекиККМ.Склад КАК Склад,
		|		ЧекиККМ.Валюта КАК Валюта,
		|		ЧекиККМ.ВидЦены КАК ВидЦены
		|	ИЗ
	    |		ЧекиККМ КАК ЧекиККМ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.ОплатаПлатежнымиКартами КАК ЧекККМОплатаПлатежнымиКартами
		|			ПО ЧекККМОплатаПлатежнымиКартами.Ссылка = ЧекиККМ.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ ЧекиККМПоКоторымОформленВозвратВСмену КАК ЧекиККМПоКоторымОформленВозвратВСмену
		|			ПО ЧекиККМПоКоторымОформленВозвратВСмену.ЧекККМ = ЧекККМОплатаПлатежнымиКартами.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ ЧекиККМВозвратПоКоторымОтражаетсяВОРВ КАК ЧекиККМВозвратПоКоторымОтражаетсяВОРВ
		|			ПО ЧекиККМВозвратПоКоторымОтражаетсяВОРВ.ЧекККМ = ЧекККМОплатаПлатежнымиКартами.Ссылка
		|	ГДЕ
		|		ЧекиККМ.ПоЧекуКоррекции = ЛОЖЬ
		|		И ЧекиККМВозвратПоКоторымОтражаетсяВОРВ.ЧекККМ ЕСТЬ NULL
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		// Все возвраты по чекам продажи за смену, кроме полностью возвращенных и которые были оплачены смешанно
		|	ВЫБРАТЬ
		|		1 КАК НомерГруппировки,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.ВидОплаты,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.ЭквайринговыйТерминал,
		|		"""",
		|		"""",
		|		ЧекККМВозвратОплатаПлатежнымиКартами.ДоговорПодключения,
		|		-ЧекККМВозвратОплатаПлатежнымиКартами.Сумма,
		|		ЧекиККМ.КассаККМ,
		|		ЧекиККМ.Организация,
		|		ЧекиККМ.Склад,
		|		ЧекиККМ.Валюта,
		|		ЧекиККМ.ВидЦены
		|	ИЗ
		|		ЧекиККМ КАК ЧекиККМ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.ОплатаПлатежнымиКартами КАК ЧекККМВозвратОплатаПлатежнымиКартами
		|			ПО ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка = ЧекиККМ.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ ЧекиККМВозвратПоКоторымОтражаетсяВОРВ КАК ЧекиККМВозвратПоКоторымОтражаетсяВОРВ
		|			ПО ЧекиККМВозвратПоКоторымОтражаетсяВОРВ.ЧекККМ = ЧекиККМ.ЧекККМ 
		|	ГДЕ
		|		ЧекККМВозвратОплатаПлатежнымиКартами.ОплатаОтменена
		|		И ЧекиККМВозвратПоКоторымОтражаетсяВОРВ.ЧекККМ ЕСТЬ NULL
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		// Оплаты полностью возращенных чеков продажи в смену, которые были оплачены смешанно
		|	ВЫБРАТЬ
		|		2 КАК НомерГруппировки,
		|		ЧекККМОплатаПлатежнымиКартами.ВидОплаты КАК ВидОплаты,
		|		ЧекККМОплатаПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
		|		ЧекККМОплатаПлатежнымиКартами.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
		|		ЧекККМОплатаПлатежнымиКартами.КодАвторизации КАК КодАвторизации,
		|		ЧекККМОплатаПлатежнымиКартами.ДоговорПодключения КАК ДоговорПодключения,
		|		ЧекККМОплатаПлатежнымиКартами.Сумма КАК Сумма,
		|		ЧекиККМ.КассаККМ КАК КассаККМ,
		|		ЧекиККМ.Организация КАК Организация,
		|		ЧекиККМ.Склад КАК Склад,
		|		ЧекиККМ.Валюта КАК Валюта,
		|		ЧекиККМ.ВидЦены КАК ВидЦены
		|	ИЗ
		|		ЧекиККМВозвратПоКоторымОтражаетсяВОРВ КАК ЧекиККМВозвратПоКоторымОтражаетсяВОРВ
		|			ЛЕВОЕ СОЕДИНЕНИЕ ЧекиККМ КАК ЧекиККМ
		|			ПО ЧекиККМВозвратПоКоторымОтражаетсяВОРВ.ЧекККМ = ЧекиККМ.Ссылка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.ОплатаПлатежнымиКартами КАК ЧекККМОплатаПлатежнымиКартами
		|			ПО ЧекККМОплатаПлатежнымиКартами.Ссылка = ЧекиККМ.Ссылка) КАК ОплатаПлатежнымиКартами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО ОплатаПлатежнымиКартами.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И ОплатаПлатежнымиКартами.Организация = ИндексыПоАналитике.Организация
		#Удаление
		|			И ОплатаПлатежнымиКартами.Склад = ИндексыПоАналитике.Склад
		#КонецУдаления
		|			И ОплатаПлатежнымиКартами.Валюта = ИндексыПоАналитике.Валюта
		|			И ОплатаПлатежнымиКартами.ВидЦены = ИндексыПоАналитике.ВидЦены
		#Удаление 
		|
		|СГРУППИРОВАТЬ ПО
        |	ОплатаПлатежнымиКартами.НомерГруппировки,
		|	ОплатаПлатежнымиКартами.ВидОплаты,
		|	ОплатаПлатежнымиКартами.ЭквайринговыйТерминал,
		|	ОплатаПлатежнымиКартами.НомерПлатежнойКарты,
		|	ОплатаПлатежнымиКартами.КодАвторизации,
		|	ОплатаПлатежнымиКартами.ДоговорПодключения,
		|	ИндексыПоАналитике.ИндексПоАналитике
		|
		#КонецУдаления
		|УПОРЯДОЧИТЬ ПО
        |	НомерГруппировки,
		|	ВидОплаты,
		|	ЭквайринговыйТерминал,
		|	ИндексПоАналитике,
		|	НомерПлатежнойКарты,
		|	КодАвторизации,
		|	ДоговорПодключения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Серии.Помещение КАК Помещение,
		|	Серии.Серия КАК Серия,
		|	Серии.Номенклатура КАК Номенклатура,
		|	Серии.Характеристика КАК Характеристика,
		|	СУММА(Серии.Количество) КАК Количество,
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЧекККМСерии.Помещение КАК Помещение,
		|		ЧекККМСерии.Серия КАК Серия,
		|		ЧекККМСерии.Номенклатура КАК Номенклатура,
		|		ЧекККМСерии.Характеристика КАК Характеристика,
		|		ЧекККМСерии.Количество КАК Количество,
		|		ЧекиККМ.КассаККМ КАК КассаККМ,
		|		ЧекиККМ.Организация КАК Организация,
		|		ЧекиККМ.Склад КАК Склад,
		|		ЧекиККМ.Валюта КАК Валюта,
		|		ЧекиККМ.ВидЦены КАК ВидЦены
		|	ИЗ
		|		ЧекиККМ КАК ЧекиККМ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Серии КАК ЧекККМСерии
		|			ПО (ЧекККМСерии.Ссылка = ЧекиККМ.Ссылка)
		|	ГДЕ
		|		ЧекиККМ.ПоЧекуКоррекции = ЛОЖЬ
        |		И ЧекиККМ.ВозвратВСменуПродажи = ЛОЖЬ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
    	|		МАКСИМУМ(ЧекККМСерии.Помещение) КАК Помещение,
		|		ЧекККМСерии.Серия КАК Серия,
		|		ЧекККМСерии.Номенклатура КАК Номенклатура,
		|		ЧекККМСерии.Характеристика КАК Характеристика,
		|		СУММА(ЧекККМСерии.Количество) КАК Количество,
		|		ЧекККМСерии.КассаККМ КАК КассаККМ,
		|		ЧекККМСерии.Организация КАК Организация,
		|		ЧекККМСерии.Склад КАК Склад,
		|		ЧекККМСерии.Валюта КАК Валюта,
		|		ЧекККМСерии.ВидЦены КАК ВидЦены
		|    ИЗ
		|		(ВЫБРАТЬ
		|			ЧекККМСерии.Помещение КАК Помещение,
		|			ЧекККМСерии.Серия КАК Серия,
		|			ЧекККМСерии.Номенклатура КАК Номенклатура,
		|			ЧекККМСерии.Характеристика КАК Характеристика,
		|			ЧекККМСерии.Количество КАК Количество,
		|			ЧекиККМ.КассаККМ КАК КассаККМ,
		|			ЧекиККМ.Организация КАК Организация,
		|			ЧекиККМ.Склад КАК Склад,
		|			ЧекиККМ.Валюта КАК Валюта,
		|			ЧекиККМ.ВидЦены КАК ВидЦены
		|		ИЗ
		|			ЧекиККМ КАК ЧекиККМ
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Серии КАК ЧекККМСерии
		|				ПО (ЧекККМСерии.Ссылка = ЧекиККМ.Ссылка)
		|		ГДЕ
		|			ЧекиККМ.ПоЧекуКоррекции = ЛОЖЬ
		|			И ЧекиККМ.ВозвратВСменуПродажи = ИСТИНА
		|
		|		ОБЪЕДИНИТЬ ВСЕ
		|
		|		ВЫБРАТЬ
		|			ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка),
		|			ЧекККМВозвратСерии.Серия,
		|			ЧекККМВозвратСерии.Номенклатура,
		|			ЧекККМВозвратСерии.Характеристика,
		|			-ЧекККМВозвратСерии.Количество,
		|			ЧекиККМ.КассаККМ,
		|			ЧекиККМ.Организация,
		|			ЧекиККМ.Склад,
		|			ЧекиККМ.Валюта,
		|			ЧекиККМ.ВидЦены
		|		ИЗ
		|			ЧекиККМ КАК ЧекиККМ
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.Серии КАК ЧекККМВозвратСерии
		|				ПО (ЧекККМВозвратСерии.Ссылка = ЧекиККМ.Ссылка)
		|		ГДЕ
		|			ЧекиККМ.ПоЧекуКоррекции = ЛОЖЬ) КАК ЧекККМСерии
		|
		|	СГРУППИРОВАТЬ ПО
		|		ЧекККМСерии.Серия,
		|		ЧекККМСерии.Номенклатура,
		|		ЧекККМСерии.Характеристика,
		|		ЧекККМСерии.КассаККМ,
		|		ЧекККМСерии.Организация,
		|		ЧекККМСерии.Склад,
		|		ЧекККМСерии.Валюта,
		|		ЧекККМСерии.ВидЦены
		|	ИМЕЮЩИЕ 
		|		СУММА(ЧекККМСерии.Количество) > 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЧекККМСерии.Помещение,
		|		ЧекККМСерии.Серия,
		|		ЧекККМСерии.Номенклатура,
		|		ЧекККМСерии.Характеристика,
		|		-ЧекККМСерии.Количество,
		|		ЧекиККМ.КассаККМ,
		|		ЧекиККМ.Организация,
		|		ЧекиККМ.Склад,
		|		ЧекиККМ.Валюта,
		|		ЧекиККМ.ВидЦены
		|	ИЗ
		|		ЧекиККМ КАК ЧекиККМ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Серии КАК ЧекККМСерии
		|			ПО (ЧекККМСерии.Ссылка = ЧекиККМ.Ссылка)
		|	ГДЕ
		|		ЧекиККМ.ПоЧекуКоррекции = ИСТИНА
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЧекККМКоррекцииСерии.Помещение,
		|		ЧекККМКоррекцииСерии.Серия,
		|		ЧекККМКоррекцииСерии.Номенклатура,
		|		ЧекККМКоррекцииСерии.Характеристика,
		|		ЧекККМКоррекцииСерии.Количество,
		|		ЧекиККМ.КассаККМ,
		|		ЧекиККМ.Организация,
		|		ЧекиККМ.Склад,
		|		ЧекиККМ.Валюта,
		|		ЧекиККМ.ВидЦены
		|	ИЗ
		|		ЧекиККМ КАК ЧекиККМ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМКоррекции.Серии КАК ЧекККМКоррекцииСерии
		|			ПО (ЧекККМКоррекцииСерии.Ссылка = ЧекиККМ.Ссылка)
		|				И ЧекККМКоррекцииСерии.Ссылка.ВидКоррекции = ЗНАЧЕНИЕ(Перечисление.ВидыЧековКоррекции.ИсправлениеОшибки)
		|	ГДЕ
		|		ЧекиККМ.ПоЧекуКоррекции = ИСТИНА) КАК Серии
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО Серии.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И Серии.Организация = ИндексыПоАналитике.Организация
		#Удаление
		|			И Серии.Склад = ИндексыПоАналитике.Склад
		#КонецУдаления
		|			И Серии.Валюта = ИндексыПоАналитике.Валюта
		|			И Серии.ВидЦены = ИндексыПоАналитике.ВидЦены
		|
		|СГРУППИРОВАТЬ ПО
		|	Серии.Помещение,
		|	Серии.Серия,
		|	Серии.Номенклатура,
		|	Серии.Характеристика,
		|	ИндексыПоАналитике.ИндексПоАналитике
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИндексПоАналитике,
		|	Помещение,
		|	Номенклатура,
		|	Характеристика,
		|	Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	СУММА(ПодарочныеСертификаты.Количество) КАК Количество,
		|	СУММА(ПодарочныеСертификаты.Сумма) КАК Сумма,
		|	СУММА(ПодарочныеСертификаты.СуммаВВалютеСертификата) КАК СуммаВВалютеСертификата,
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЧекККМПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|		1 КАК Количество,
		|		ЧекККМПодарочныеСертификаты.Сумма КАК Сумма,
		|		ЧекККМПодарочныеСертификаты.СуммаВВалютеСертификата КАК СуммаВВалютеСертификата,
		|		ЧекиККМ.КассаККМ КАК КассаККМ,
		|		ЧекиККМ.Организация КАК Организация,
		|		ЧекиККМ.Склад КАК Склад,
		|		ЧекиККМ.Валюта КАК Валюта,
		|		ЧекиККМ.ВидЦены КАК ВидЦены
		|	ИЗ
		|		ЧекиККМ КАК ЧекиККМ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.ПодарочныеСертификаты КАК ЧекККМПодарочныеСертификаты
		|			ПО (ЧекККМПодарочныеСертификаты.Ссылка = ЧекиККМ.Ссылка)
		|	ГДЕ
		|		ЧекиККМ.ПоЧекуКоррекции = ЛОЖЬ
		|	) КАК ПодарочныеСертификаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО ПодарочныеСертификаты.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И ПодарочныеСертификаты.Организация = ИндексыПоАналитике.Организация
		#Удаление
		|			И ПодарочныеСертификаты.Склад = ИндексыПоАналитике.Склад
		#КонецУдаления
		|			И ПодарочныеСертификаты.Валюта = ИндексыПоАналитике.Валюта
		|			И ПодарочныеСертификаты.ВидЦены = ИндексыПоАналитике.ВидЦены
		|
		|СГРУППИРОВАТЬ ПО
		|	ПодарочныеСертификаты.ПодарочныйСертификат,
		|	ИндексыПоАналитике.ИндексПоАналитике
		|
		|ИМЕЮЩИЕ
		|	СУММА(ПодарочныеСертификаты.Количество) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодарочныйСертификат,
		|	ИндексПоАналитике
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.ДатаНачисления КАК ДатаНачисления,
		|	БонусныеБаллы.ДатаСписания КАК ДатаСписания,
		|	БонусныеБаллы.Партнер КАК Партнер,
		|	СУММА(БонусныеБаллы.СуммаБонусныхБаллов) КАК СуммаБонусныхБаллов
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЧекиККМ.КассаККМ КАК КассаККМ,
		|		ЧекиККМ.Организация КАК Организация,
		|		ЧекиККМ.Склад КАК Склад,
		|		ЧекиККМ.Валюта КАК Валюта,
		|		ЧекиККМ.ВидЦены КАК ВидЦены,
		|		ЧекиККМ.Партнер КАК Партнер,
		|		БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|		БонусныеБаллы.ДатаНачисления КАК ДатаНачисления,
		|		БонусныеБаллы.ДатаСписания КАК ДатаСписания,
		|		БонусныеБаллы.СуммаБонусныхБаллов КАК СуммаБонусныхБаллов
		|	ИЗ
		|		ЧекиККМ КАК ЧекиККМ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.БонусныеБаллы КАК БонусныеБаллы
		|			ПО (БонусныеБаллы.Ссылка = ЧекиККМ.Ссылка)
		|	ГДЕ
		|		ЧекиККМ.ПоЧекуКоррекции = ЛОЖЬ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЧекиККМ.КассаККМ,
		|		ЧекиККМ.Организация,
		|		ЧекиККМ.Склад,
		|		ЧекиККМ.Валюта,
		|		ЧекиККМ.ВидЦены,
		|		ЧекиККМ.Партнер,
		|		БонусныеБаллы.БонуснаяПрограммаЛояльности,
		|		БонусныеБаллы.ДатаНачисления,
		|		БонусныеБаллы.ДатаСписания,
		|		-БонусныеБаллы.СуммаБонусныхБаллов
		|	ИЗ
		|		ЧекиККМ КАК ЧекиККМ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.БонусныеБаллы КАК БонусныеБаллы
		|			ПО (БонусныеБаллы.Ссылка = ЧекиККМ.Ссылка)) КАК БонусныеБаллы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО БонусныеБаллы.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И БонусныеБаллы.Организация = ИндексыПоАналитике.Организация
		#Удаление
		|			И БонусныеБаллы.Склад = ИндексыПоАналитике.Склад
		#КонецУдаления
		|			И БонусныеБаллы.Валюта = ИндексыПоАналитике.Валюта
		|			И БонусныеБаллы.ВидЦены = ИндексыПоАналитике.ВидЦены
		|
		|СГРУППИРОВАТЬ ПО
		|	ИндексыПоАналитике.ИндексПоАналитике,
		|	БонусныеБаллы.ДатаНачисления,
		|	БонусныеБаллы.ДатаСписания,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер
		|
		|ИМЕЮЩИЕ
		|	СУММА(БонусныеБаллы.СуммаБонусныхБаллов) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Партнер,
		|	БонуснаяПрограммаЛояльности,
		|	ИндексПоАналитике,
		|	ДатаНачисления,
		|	ДатаСписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.ДатаОплаты КАК ДатаОплаты,
		|	БонусныеБаллы.Партнер КАК Партнер,
		|	СУММА(БонусныеБаллы.СуммаБонусныхБаллов) КАК СуммаБонусныхБаллов
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЧекиККМ.КассаККМ КАК КассаККМ,
		|		ЧекиККМ.Организация КАК Организация,
		|		ЧекиККМ.Склад КАК Склад,
		|		ЧекиККМ.Валюта КАК Валюта,
		|		ЧекиККМ.ВидЦены КАК ВидЦены,
		|		ЧекиККМ.Партнер КАК Партнер,
		|		Таблица.Ссылка.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|		НАЧАЛОПЕРИОДА(ЧекиККМ.Дата, ДЕНЬ) КАК ДатаОплаты,
		|		Таблица.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБаллов
		|	ИЗ
		|		ЧекиККМ КАК ЧекиККМ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК Таблица
		|			ПО (Таблица.Ссылка = ЧекиККМ.Ссылка)
		|	ГДЕ
		|		ЧекиККМ.ПоЧекуКоррекции = ЛОЖЬ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЧекККМВозврат.КассаККМ,
		|		ЧекККМВозврат.Организация,
		|		ЧекККМВозврат.Склад,
		|		ЧекККМВозврат.Валюта,
		|		ЧекККМВозврат.ВидЦены,
		|		ЧекККМВозврат.Партнер,
		|		ЧекККМВозврат.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности,
		|		НАЧАЛОПЕРИОДА(ЧекККМВозврат.Дата, ДЕНЬ),
		|		-ЧекККМВозврат.СуммаБонусныхБалловКВозврату
		|	ИЗ
		|		ЧекиККМ КАК ЧекиККМ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат КАК ЧекККМВозврат
		|			ПО (ЧекККМВозврат.Ссылка = ЧекиККМ.Ссылка)) КАК БонусныеБаллы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО БонусныеБаллы.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И БонусныеБаллы.Организация = ИндексыПоАналитике.Организация
		#Удаление
		|			И БонусныеБаллы.Склад = ИндексыПоАналитике.Склад
		#КонецУдаления
		|			И БонусныеБаллы.Валюта = ИндексыПоАналитике.Валюта
		|			И БонусныеБаллы.ВидЦены = ИндексыПоАналитике.ВидЦены
		|
		|СГРУППИРОВАТЬ ПО
		|	ИндексыПоАналитике.ИндексПоАналитике,
		|	БонусныеБаллы.ДатаОплаты,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер
		|
		|ИМЕЮЩИЕ
		|	СУММА(БонусныеБаллы.СуммаБонусныхБаллов) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Партнер,
		|	БонуснаяПрограммаЛояльности,
		|	ИндексПоАналитике,
		|	ДатаОплаты
		|;
		#Удаление
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике,
		|	АкцизныеМарки.Справка2 КАК Справка2,
		|	АкцизныеМарки.АкцизнаяМарка КАК АкцизнаяМарка
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЧекиККМ.КассаККМ КАК КассаККМ,
		|		ЧекиККМ.Организация КАК Организация,
		|		ЧекиККМ.Склад КАК Склад,
		|		ЧекиККМ.Валюта КАК Валюта,
		|		ЧекиККМ.ВидЦены КАК ВидЦены,
		|		Таблица.Справка2 КАК Справка2,
		|		Таблица.АкцизнаяМарка КАК АкцизнаяМарка,
		|		1 КАК КоличествоАкцизов
		|	ИЗ
		|		ЧекиККМ КАК ЧекиККМ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.АкцизныеМарки КАК Таблица
		|			ПО (Таблица.Ссылка = ЧекиККМ.Ссылка)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЧекиККМ.КассаККМ,
		|		ЧекиККМ.Организация,
		|		ЧекиККМ.Склад,
		|		ЧекиККМ.Валюта,
		|		ЧекиККМ.ВидЦены,
		|		Таблица.Справка2,
		|		Таблица.АкцизнаяМарка,
		|		-1
		|	ИЗ
		|		ЧекиККМ КАК ЧекиККМ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.АкцизныеМарки КАК Таблица
		|			ПО (Таблица.Ссылка = ЧекиККМ.Ссылка)) КАК АкцизныеМарки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО АкцизныеМарки.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И АкцизныеМарки.Организация = ИндексыПоАналитике.Организация
		|			И АкцизныеМарки.Склад = ИндексыПоАналитике.Склад
		|			И АкцизныеМарки.Валюта = ИндексыПоАналитике.Валюта
		|			И АкцизныеМарки.ВидЦены = ИндексыПоАналитике.ВидЦены
		|
		|СГРУППИРОВАТЬ ПО
		|	ИндексыПоАналитике.ИндексПоАналитике,
		|	АкцизныеМарки.Справка2,
		|	АкцизныеМарки.АкцизнаяМарка
		|
		|ИМЕЮЩИЕ
		|	СУММА(АкцизныеМарки.КоличествоАкцизов) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИндексПоАналитике,
		|	АкцизнаяМарка
		|;
		#КонецУдаления
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СписокТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЧекиККМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИндексыПоАналитике
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИндексыПоНоменклатуре";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("ТаблицаИндексовПоАналитике", ТаблицаИндексовПоАналитике);
		Запрос.УстановитьПараметр("ТаблицаИндексовПоНоменклатуре", ТаблицаИндексовПоНоменклатуре);
		
		Результат = Запрос.ВыполнитьПакет();
		
		ОплатаПлатежнымиКартами = Результат[3].Выгрузить(); // ТаблицаЗначений
		Серии                   = Результат[4].Выгрузить(); // ТаблицаЗначений
		ПодарочныеСертификаты   = Результат[5].Выгрузить(); // ТаблицаЗначений
		БонусныеБаллы           = Результат[6].Выгрузить(); // ТаблицаЗначений
		ОплатаБонуснымиБаллами  = Результат[7].Выгрузить(); // ТаблицаЗначений
		#Удаление
		АкцизныеМарки           = Результат[8].Выгрузить(); // ТаблицаЗначений
		#КонецУдаления
		#Вставка
		ОплатаПлатежнымиКартами.ЗаполнитьЗначения(0, "ИндексПоАналитике"); 
		Серии.ЗаполнитьЗначения(0, "ИндексПоАналитике");
		ПодарочныеСертификаты.ЗаполнитьЗначения(0, "ИндексПоАналитике");
		ОплатаБонуснымиБаллами.ЗаполнитьЗначения(0, "ИндексПоАналитике");
		#КонецВставки
	
		ОплатаПлатежнымиКартами.Индексы.Добавить("ИндексПоАналитике");
		Серии.Индексы.Добавить("ИндексПоАналитике");
		ПодарочныеСертификаты.Индексы.Добавить("ИндексПоАналитике");
		БонусныеБаллы.Индексы.Добавить("ИндексПоАналитике");
		ОплатаБонуснымиБаллами.Индексы.Добавить("ИндексПоАналитике");
		#Удаление
		АкцизныеМарки.Индексы.Добавить("ИндексПоАналитике");
		#КонецУдаления
		
		ВыборкаПоАналитике = Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
		// Очистим табличные части документа.
		ОтчетОРозничныхПродажахОбъект.Товары.Очистить();
		ОтчетОРозничныхПродажахОбъект.Серии.Очистить();
		ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Очистить();
		ОтчетОРозничныхПродажахОбъект.ВидыЗапасов.Очистить();
		ОтчетОРозничныхПродажахОбъект.ПодарочныеСертификаты.Очистить();
		ОтчетОРозничныхПродажахОбъект.НачислениеБонусныхБаллов.Очистить();
		ОтчетОРозничныхПродажахОбъект.ОплатаБонуснымиБаллами.Очистить();
		#Удаление
		ОтчетОРозничныхПродажахОбъект.АкцизныеМарки.Очистить();
		#КонецУдаления
	
		Если ВыборкаПоАналитике.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(ОтчетОРозничныхПродажахОбъект, ВыборкаПоАналитике);
			
			ВыборкаПоАналитикеНоменклатуры = ВыборкаПоАналитике.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоАналитикеНоменклатуры.Следующий() Цикл
				
				ВыборкаДетальныеЗаписи = ВыборкаПоАналитикеНоменклатуры.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					СтрокаТабличнойЧастиТовары = ОтчетОРозничныхПродажахОбъект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧастиТовары, ВыборкаДетальныеЗаписи);
					СтрокаТабличнойЧастиТоварыКоличествоУпаковок = ?(СтрокаТабличнойЧастиТовары.КоличествоУпаковок = 0, ВыборкаДетальныеЗаписи.Количество, СтрокаТабличнойЧастиТовары.КоличествоУпаковок);
					СтрокаТабличнойЧастиТовары.Цена = Окр(СтрокаТабличнойЧастиТовары.Сумма / СтрокаТабличнойЧастиТоварыКоличествоУпаковок, 15, 2);
					ПодобратьЗаполнитьДокументРеализацииВСтроке(СтрокаТабличнойЧастиТовары, ТаблицаДокументовРеализации, СостояниеКассовойСмены, ВыборкаДетальныеЗаписи, Истина);
					
				КонецЦикла;
				
			КонецЦикла;
			
			// Заполнение табличной части "Оплата платежными картами".
			#Удаление
			МассивСтрок = ОплатаПлатежнымиКартами.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			#КонецУдаления
			#Вставка
			МассивСтрок = ОплатаПлатежнымиКартами.НайтиСтроки(Новый Структура("ИндексПоАналитике", 0));
			#КонецВставки
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл
				
				Если СтрокаТЧ.Сумма <> 0 Тогда
					СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				КонецЕсли;
				
			КонецЦикла;
			
			#Вставка
			ВременнаяТаблица = ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Выгрузить(); 
			ВременнаяТаблица.Свернуть("ЭквайринговыйТерминал,НомерПлатежнойКарты,КодАвторизации,ВидОплаты,ДоговорПодключения","Сумма");
			ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Загрузить(ВременнаяТаблица);
			МассивНулевыхСтрок = ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.НайтиСтроки(Новый Структура("Сумма",0));
			Для Каждого Строка Из МассивНулевыхСтрок Цикл 
					ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Удалить(Строка);
			КонецЦикла;
			#КонецВставки
			// Заполнение табличной части "Серии".
			#Удаление
			МассивСтрок = Серии.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			#КонецУдаления
			#Вставка
			МассивСтрок = Серии.НайтиСтроки(Новый Структура("ИндексПоАналитике", 0));
			#КонецВставки
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл
				
				Если СтрокаТЧ.Количество <> 0 Тогда
					СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.Серии.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				КонецЕсли;
				
			КонецЦикла;
			
			// Заполнение табличной части "Подарочные сертификаты".
			#Удаление
			МассивСтрок = ПодарочныеСертификаты.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			#КонецУдаления
			#Вставка
			МассивСтрок = ПодарочныеСертификаты.НайтиСтроки(Новый Структура("ИндексПоАналитике", 0)); 
			#КонецВставки
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл
				
				Если СтрокаТЧ.Сумма <> 0 Тогда
					СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.ПодарочныеСертификаты.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				КонецЕсли;
				
			КонецЦикла;
			
			// Заполнение табличной части "БонусныеБаллы".
			МассивСтрок = БонусныеБаллы.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			#Вставка
			Если ЗначениеЗаполнено(ВыборкаПоАналитике.ИндексПоАналитике) Тогда
				МассивСтрок = БонусныеБаллы.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике)); 
			Иначе
				МассивСтрок = БонусныеБаллы.НайтиСтроки(Новый Структура("ИндексПоАналитике", 0));        
			КонецЕсли;
			#КонецВставки
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл
				
				СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.НачислениеБонусныхБаллов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				
			КонецЦикла;
			
			// Заполнение табличной части "ОплатаБонуснымиБаллами".
			#Удаление
			МассивСтрок = ОплатаБонуснымиБаллами.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			#КонецУдаления
			#Вставка
			МассивСтрок = ОплатаБонуснымиБаллами.НайтиСтроки(Новый Структура("ИндексПоАналитике", 0)); 
			#КонецВставки
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл
				
				СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.ОплатаБонуснымиБаллами.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				#Вставка
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.БонуснаяПрограммаЛояльности) Тогда
					СтрокаТабличнойЧасти.БонуснаяПрограммаЛояльности = АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму();
				КонецЕсли;
				#КонецВставки
				
			КонецЦикла;
			
			#Удаление
			// Заполнение табличной части "АкцизныеМарки".
			МассивСтрок = АкцизныеМарки.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл
				
				СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.АкцизныеМарки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				
			КонецЦикла;
			#КонецУдаления
			
			ОтчетОРозничныхПродажахОбъект.Дата            = СостояниеКассовойСмены.ДатаИзмененияСтатуса;
			ОтчетОРозничныхПродажахОбъект.ЦенаВключаетНДС = СостояниеКассовойСмены.ЦенаВключаетНДС;
			ОтчетОРозничныхПродажахОбъект.КассоваяСмена   = СостояниеКассовойСмены.КассоваяСмена;
			ОтчетОРозничныхПродажахОбъект.Подразделение   = СостояниеКассовойСмены.Подразделение;
			
			ОтчетОРозничныхПродажахОбъект.СуммаДокумента  = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(ОтчетОРозничныхПродажахОбъект.Товары, ОтчетОРозничныхПродажахОбъект.ЦенаВключаетНДС);
			
			ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ОтчетОРозничныхПродажахОбъект);
			
			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Ответственный) Тогда
				ОтчетОРозничныхПродажахОбъект.Ответственный = Пользователи.ТекущийПользователь();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Подразделение) Тогда
				ОтчетОРозничныхПродажахОбъект.Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(ОтчетОРозничныхПродажахОбъект.Ответственный, ОтчетОРозничныхПродажахОбъект.Подразделение);
			КонецЕсли;
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(Документы.ОтчетОРозничныхПродажах.ПараметрыУказанияСерий(ОтчетОРозничныхПродажахОбъект));
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ОтчетОРозничныхПродажахОбъект, ПараметрыУказанияСерий);
						
		Иначе
			// По кассовой смене не продано товара		
			// Заполняет отчет о розничных продажах данными по текущей кассовой смене.
			ЗаполнитьЗначенияСвойств(ОтчетОРозничныхПродажахОбъект, СостояниеКассовойСмены, , "НалогообложениеНДС");
			
			ОтчетОРозничныхПродажахОбъект.Дата           		= СостояниеКассовойСмены.ДатаИзмененияСтатуса;
			ОтчетОРозничныхПродажахОбъект.НалогообложениеНДС  	= НалогообложениеНДС;
			
			ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ОтчетОРозничныхПродажахОбъект);
					
			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Ответственный) Тогда
				ОтчетОРозничныхПродажахОбъект.Ответственный = Пользователи.ТекущийПользователь();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Подразделение) Тогда
			#Вставка
			Если ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.КассаККМ)
					И ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.КассаККМ.Подразделение) Тогда
					ОтчетОРозничныхПродажахОбъект.Подразделение = ОтчетОРозничныхПродажахОбъект.КассаККМ.Подразделение;
			Иначе
			#КонецВставки
				ОтчетОРозничныхПродажахОбъект.Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(ОтчетОРозничныхПродажахОбъект.Ответственный, ОтчетОРозничныхПродажахОбъект.Подразделение);
			#Вставка
			КонецЕсли;
			#КонецВставки 
			КонецЕсли;
            
			// Заполнение табличной части "Оплата платежными картами".
			Для Каждого СтрокаТЧ Из ОплатаПлатежнымиКартами Цикл
				
				Если СтрокаТЧ.Сумма <> 0 Тогда
					СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				КонецЕсли;
				
			КонецЦикла;
			
			// Заполнение табличной части "Подарочные сертификаты".
			Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
				
				Если СтрокаТЧ.Сумма <> 0 Тогда
					СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.ПодарочныеСертификаты.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				КонецЕсли;
				
			КонецЦикла;
			
			ОтчетОРозничныхПродажахОбъект.СуммаДокумента = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(ОтчетОРозничныхПродажахОбъект.Товары, ОтчетОРозничныхПродажахОбъект.ЦенаВключаетНДС);
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(Документы.ОтчетОРозничныхПродажах.ПараметрыУказанияСерий(ОтчетОРозничныхПродажахОбъект));
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ОтчетОРозничныхПродажахОбъект, ПараметрыУказанияСерий);
						
		КонецЕсли;
		
		ОтчетОРозничныхПродажахЛокализация.ОбработкаЗаполнения(ОтчетОРозничныхПродажахОбъект, Неопределено, Истина);
		
		Если Не ТолькоЗаполнить Тогда
			
			ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Запись);
			Если ОтчетОРозничныхПродажахОбъект.ПроверитьЗаполнение() Тогда
				ЭтоПопыткаПроведенияДокумента = Истина;
				ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ОписаниеОшибки = НСтр("ru = 'При проверке заполнения перед проведением документа %Документ% по кассовой смене %КассоваяСмена% произошла ошибка. Документ записан, но не проведен.'");
				ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%КассоваяСмена%", СостояниеКассовойСмены.КассоваяСмена);
				ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Документ%", ОтчетОРозничныхПродажахОбъект.Ссылка);
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Розничные продажи'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат ОтчетОРозничныхПродажахОбъект.Ссылка;
		
	Исключение
		
		ОписаниеОшибки = НСтр("ru = 'При создании отчета о розничных продажах по кассовой смене %КассоваяСмена% произошла ошибка.
		                            |Дополнительное описание:
		                            |%ДополнительноеОписание%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%КассоваяСмена%", СостояниеКассовойСмены.КассоваяСмена);
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Розничные продажи'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		
		Возврат ?(Не ТолькоЗаполнить И ЭтоПопыткаПроведенияДокумента И ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Ссылка), ОтчетОРозничныхПродажахОбъект.Ссылка, Неопределено);
		
	КонецПопытки;
	
КонецФункции  
 

&ИзменениеИКонтроль ("ОбработатьДанныеЭлектронногоЧека")
Функция Спр_ОбработатьДанныеЭлектронногоЧека(Форма) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
	
		ДанныеЭлектронногоЧека = РозничныеПродажиКлиентСервер.ДанныеЭлектронногоЧека(Форма);
		РезультатПроверки = РозничныеПродажиКлиентСервер.ПроверитьНеобходимостьОбработкиДанныхЭлектронногоЧека(Форма);
		
		Если РезультатПроверки.ТребуетсяСоздатьПартнера Тогда
			
			ДанныеЭлектронногоЧека.Партнер = СоздатьПартнераВладельцаКонтактнойИнформацииЭлектронногоЧека(ДанныеЭлектронногоЧека);
			ОбновитьКонтактнуюИнформациюПартнера(ДанныеЭлектронногоЧека);
			
		Иначе
			#Вставка
			Если Не ДанныеЭлектронногоЧека.Партнер = Справочники.Партнеры.НеизвестныйПартнер Тогда
			#КонецВставки	
				Если РезультатПроверки.ТребуетсяОбновитьКонтактнуюИнформацию Тогда
					
					ОбновитьКонтактнуюИнформациюПартнера(ДанныеЭлектронногоЧека);
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДанныеЭлектронногоЧека.Партнер)
					И РезультатПроверки.ТребуетсяОбновитьВариантОтправкиЭлектронногоЧекаПартнера Тогда
					
					ПартнерОбъект = ДанныеЭлектронногоЧека.Партнер.ПолучитьОбъект();
					ПартнерОбъект.ВариантОтправкиЭлектронногоЧека = ДанныеЭлектронногоЧека.ВариантОтправкиЭлектронногоЧека;
					ПартнерОбъект.Записать();
					
				КонецЕсли;
			#Вставка	
			КонецЕсли;
			#КонецВставки
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию(); 
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОбщегоНазначения.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Розничные продажи'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат ДанныеЭлектронногоЧека;
КонецФункции

&Вместо("ОткрытьКассовуюСмену")
Функция Док_ОткрытьКассовуюСмену(КассаККМ, ДополнительныеПараметры, ОписаниеОшибки = "")
	
	ИспользоватьДопПроверку = ДопМодуль.ПолучитьНастройкиХранилища("ВключитьДопПроверкиПоКассовымСменам").ВключитьДополнительныйПроверкиПоКассовымСменам;
	ОборудованиеПодключенноеККассеККМ = ПодключаемоеОборудованиеУТВызовСервера.ОборудованиеПодключенноеККассеККМ(КассаККМ);
	
	Если ИспользоватьДопПроверку И ОборудованиеПодключенноеККассеККМ.ККТ = Неопределено Тогда
		ОписаниеОшибки = "Оборудование текущего рабочего места не привязано к кассе ККМ! Открытие смены невозможно!";
		Результат = Ложь;
	Иначе
		ОписаниеОшибки = "";
		Результат = ПродолжитьВызов(КассаККМ, ОписаниеОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&Вместо("ЗакрытьКассовуюСмену")
Функция Док_ЗакрытьКассовуюСмену(Объект, ОписаниеОшибки)

	ИспользоватьДопПроверку = ДопМодуль.ПолучитьНастройкиХранилища("ВключитьДопПроверкиПоКассовымСменам").ВключитьДополнительныйПроверкиПоКассовымСменам;
		
	КассаККМФискальноеУстройство = КассаККМФискальноеУстройство(Объект);
	ОборудованиеПодключенноеККассеККМ = ПодключаемоеОборудованиеУТВызовСервера.ОборудованиеПодключенноеККассеККМ(КассаККМФискальноеУстройство.КассаККМ);
	
	Если ИспользоватьДопПроверку И ОборудованиеПодключенноеККассеККМ.ККТ = Неопределено Тогда
		ОписаниеОшибки = "Оборудование текущего рабочего места не привязано к кассе ККМ! Закрытие смены невозможно!";
		Результат = Ложь;
	Иначе
		ОписаниеОшибки = "";
		Результат = ПродолжитьВызов(Объект, ОписаниеОшибки);
	КонецЕсли;

	Возврат Результат;
КонецФункции

Функция ПолучитьКассуККМТекущегоПользователя() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КассыККМ.КассаККМ КАК Объект
	|	ИЗ
	|	Справочник.НастройкиРМК.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.Ссылка.РабочееМесто = &РабочееМесто
	|	И КассыККМ.КассаККМ.ТипКассы = ЗНАЧЕНИЕ(Перечисление.ТипыКассККМ.ФискальныйРегистратор)
	|	И НЕ КассыККМ.ИспользоватьБезПодключенияОборудования
	|");
	Запрос.УстановитьПараметр("РабочееМесто", МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()=1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Объект;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции

&После("СформироватьДокументыДляОперацииЗакрытияКассовойСмены")
Процедура Док_СформироватьДокументыДляОперацииЗакрытияКассовойСмены(СостояниеКассовойСмены, ОписаниеОшибки, ВключатьНепроведенныеЧеки = Ложь) Экспорт
	
	ВыполнитьПроведениеВозвратов(СостояниеКассовойСмены.КассоваяСмена);

	
КонецПроцедуры

Процедура ВыполнитьПроведениеВозвратов(КассоваяСмена) Экспорт
	УстановитьПривилегированныйРежим(Истина);

		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратТоваровОтКлиента.Ссылка КАК Возврат,
		|	ОтчетОРозничныхПродажах.Ссылка КАК ДокументРеализации
		|ИЗ
		|	Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
		|		ПО ВозвратТоваровОтКлиентаТовары.Ссылка = ВозвратТоваровОтКлиента.Ссылка
		|			И (ВозвратТоваровОтКлиентаТовары.ДокументРеализации.Ссылка ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|		ПО (ВозвратТоваровОтКлиента.ЧекККМ.КассоваяСмена = ОтчетОРозничныхПродажах.КассоваяСмена)
		|ГДЕ
		|	ВозвратТоваровОтКлиента.Проведен
		|	И ВозвратТоваровОтКлиента.ЧекККМ.КассоваяСмена = &КассоваяСмена";
	
	Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВозвратТоваров=ВыборкаДетальныеЗаписи.Возврат.ПолучитьОбъект();
		ВозвратТоваров.Дата=?(значениезаполнено(ВыборкаДетальныеЗаписи.ДокументРеализации),	ВыборкаДетальныеЗаписи.ДокументРеализации.дата+1,конецдня(ВозвратТоваров.Дата));
		Для Каждого ТекСтрока Из ВозвратТоваров.Товары Цикл
			ТекСтрока.ДокументРеализации = ВыборкаДетальныеЗаписи.ДокументРеализации;
			ТекСтрока.СпособОпределенияСебестоимости = Перечисления.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи;
		конеццикла;        
		попытка
			ВозвратТоваров.Записать(РежимЗаписиДокумента.Проведение);
		исключение      
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		конецпопытки;	
	КонецЦикла;


КонецПроцедуры
